lierda-iot/WizBlock/CODE/examples/xiaozhi_ai_demo/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_XIAOZHI_DEVICE_MAC="2e:ee:8c:6b:58:28"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=2048
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=16
CONFIG_WEBSOCKET_CLIENT_TASK_STACK_SIZE=6144
CONFIG_SR_WN_WN9S_NIHAOXIAOZHI=y
CONFIG_SR_NSN_NSNET2=y
CONFIG_MODEL_IN_SPIFFS=y
CONFIG_MODEL_IN_FLASH=n
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
